run_cases/case05_singleGaussianWaveWithheatedFlow/constant/nonLinearZone/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/nonLinearZone/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    interfaceL
    {
        type            patch;
        nFaces          1;
        startFace       199;
    }
    interfaceR
    {
        type            patch;
        nFaces          1;
        startFace       200;
    }
    top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       201;
    }
    bottom
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       401;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       601;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       801;
    }
)

// ************************************************************************* //
