run_cases/case05_singleGaussianWaveWithheatedFlow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    interfaceL
    {
        type            patch;
        nFaces          1;
        startFace       698;
    }
    interfaceR
    {
        type            patch;
        nFaces          1;
        startFace       699;
    }
    left
    {
        type            patch;
        nFaces          1;
        startFace       700;
    }
    right
    {
        type            patch;
        nFaces          1;
        startFace       701;
    }
    top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          700;
        startFace       702;
    }
    bottom
    {
        type            empty;
        inGroups        1(empty);
        nFaces          700;
        startFace       1402;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          700;
        startFace       2102;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          700;
        startFace       2802;
    }
)

// ************************************************************************* //
