run_cases/case05_singleGaussianWaveWithheatedFlow/0.orig/nonLinearZone/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/nonLinearZone";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

#include "../../RayleighFlowProperties.H"

lvalue $lp;
rvalue $rp;

internalField   #codeStream
{
	codeInclude
    #{
        #include "fvCFD.H"
    #};
    
    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};

    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);

        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        
		scalarField p(mesh.nCells(), $lp);
		
		const scalar dp($rp - $lp);
		
		for(register label i = 0; i < $nCells; i++)
		{
			const scalar x((scalar(i) + 0.5)/$nCells);
			
			p[$offset + i] += dp*(10.0 - (15.0 - 6.0*x)*x)*pow3(x);
		}

		for(register label celli = $offset + $nCells; celli < mesh.nCells(); celli++)
		{
			p[celli] = $rp;
		}
		
		p.writeEntry("", os);
	#};
};

#include "boundaryFile"

// ************************************************************************* //
