run_cases/case05_singleGaussianWaveWithheatedFlow/0.orig/linearZone/boundaryFile
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
    location    "0";
    object      boundaryFile;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundaryField
{
    "(left|right)"
    {
        type            zeroGradient;
    }
    "(top|bottom)"
    {
        type            empty;
    }
    "(front|back)"
    {
        type            empty;
    }
}

// ************************************************************************* //
