run_cases/case05_singleGaussianWaveWithheatedFlow/system/linearZone/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../RayleighFlowProperties.H"

defaultFieldValues
(
    volScalarFieldValue p $lp
    volVectorFieldValue U ($lu 0 0)
    volScalarFieldValue T $lT
);

regions
(
    boxToCell
    {
        box ( 0 -0.5 -0.5 ) ( 1e3 0.5 0.5 );
        fieldValues
        (
            volScalarFieldValue p $rp
            volVectorFieldValue U ($ru 0 0)
            volScalarFieldValue T $rT
        );
    }
);

// ************************************************************************* //
